# St7GetFaceNormals

Returns whether to Show Normals on the geometry faces.

long St7GetFaceNormals(long uID, bool* Show)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Show

The state of the Show Normals option; either True or False.

Strand7 API Manual

Load Path Entity Display